In [2]:
import pandas as pd

In [3]:
url = 'https://raw.githubusercontent.com/KelvynAmaral/MLJourney/refs/heads/main/datasets/Tomato.csv'

In [4]:
df_excel = pd.read_excel("c:/Users/kelvyn.candido/Desktop/MLJourney/datasets/Chess.xlsx", sheet_name="Chess")

In [5]:
df_csv = pd.read_csv(url, sep=",")

In [6]:
df_csv.head()

         Date Unit  Minimum  Maximum  Average  Market
0  2013-06-16   Kg       26       32     29.0  Tomato
1  2013-06-17   Kg       20       25     22.5  Tomato
2  2013-06-18   Kg       22       26     24.0  Tomato
3  2013-06-19   Kg       24       28     26.0  Tomato
4  2013-06-20   Kg       22       26     24.0  Tomato

In [7]:
df_excel.tail()

,rated,created_at,last_move_at,turns,victory_status,winner,increment_code,white_id,white_rating,black_id,black_rating,opening_eco,opening_name,opening_ply
20053,True,1.499791e+12,1.499791e+12,24,resign,white,10+10,belcolt,1691,jamboger,1220,A80,Dutch Defense,2
20054,True,1.499698e+12,1.499699e+12,82,mate,black,10+0,jamboger,1233,farrukhasomiddinov,1196,A41,Queen's Pawn,2
20055,True,1.499698e+12,1.499698e+12,35,mate,white,10+0,jamboger,1219,schaaksmurf3,1286,D00,Queen's Pawn Game: Mason Attack,3
20056,True,1.499696e+12,1.499697e+12,109,resign,white,10+0,marcodisogno,1360,jamboger,1227,B07,Pirc Defense,4
20057,True,1.499643e+12,1.499644e+12,78,mate,black,10+0,jamboger,1235,ffbob,1339,D00,Queen's Pawn Game: Mason Attack,3

In [8]:
df_csv.shape

(2741, 6)

In [9]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20058 entries, 0 to 20057
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   rated           20058 non-null  bool
 1   created_at      20058 non-null  float64
 2   last_move_at    20058 non-null  float64
 3   turns           20058 non-null  int64
 4   victory_status  20058 non-null  object
 5   winner          20058 non-null  object
 6   increment_code  20058 non-null  object
 7   white_id        20058 non-null  object
 8   white_rating    20058 non-null  int64
 9   black_id        20058 non-null  object
 10  black_rating    20058 non-null  int64
 11  opening_eco     20058 non-null  object
 12  opening_name    20058 non-null  object
 13  opening_ply     20058 non-null  int64
dtypes: bool(1), float64(2), int64(4), object(7)
memory usage: 2.0+ MB

In [10]:
df_excel.describe()

,created_at,last_move_at,turns,white_rating,black_rating,opening_ply
count,2.005800e+04,2.005800e+04,20058.000000,20058.000000,20058.000000,20058.000000
mean,6.321335e+16,6.313080e+16,60.465999,1596.631868,1588.831987,4.816981
std,7.292307e+16,7.290633e+16,33.570585,291.253376,291.036126,2.797152
min,1.376772e+12,1.376772e+12,1.000000,784.000000,789.000000,1.000000
25%,1.498313e+12,1.498315e+12,37.000000,1398.000000,1391.000000,3.000000
50%,1.504366e+12,1.504367e+12,55.000000,1567.000000,1562.000000,4.000000
75%,1.486680e+17,1.486680e+17,79.000000,1793.000000,1784.000000,6.000000
max,1.504470e+17,1.504470e+17,349.000000,2700.000000,2723.000000,28.000000

In [11]:
df_excel.describe().T

,count,mean,std,min,25%,50%,75%,max
created_at,20058.0,6.321335e+16,7.292307e+16,1.376772e+12,1.498313e+12,1.504366e+12,1.486680e+17,1.504470e+17
last_move_at,20058.0,6.313080e+16,7.290633e+16,1.376772e+12,1.498315e+12,1.504367e+12,1.486680e+17,1.504470e+17
turns,20058.0,6.046600e+01,3.357058e+01,1.000000e+00,3.700000e+01,5.500000e+01,7.900000e+01,3.490000e+02
white_rating,20058.0,1.596632e+03,2.912534e+02,7.840000e+02,1.398000e+03,1.567000e+03,1.793000e+03,2.700000e+03
black_rating,20058.0,1.588832e+03,2.910361e+02,7.890000e+02,1.391000e+03,1.562000e+03,1.784000e+03,2.723000e+03
opening_ply,20058.0,4.816981e+00,2.797152e+00,1.000000e+00,3.000000e+00,4.000000e+00,6.000000e+00,2.800000e+01

In [12]:
set(df_excel['victory_status']) #Analisando coluna especifica.

{'draw', 'mate', 'outoftime', 'resign'}

In [13]:
df_csv.head()

         Date Unit  Minimum  Maximum  Average  Market
0  2013-06-16   Kg       26       32     29.0  Tomato
1  2013-06-17   Kg       20       25     22.5  Tomato
2  2013-06-18   Kg       22       26     24.0  Tomato
3  2013-06-19   Kg       24       28     26.0  Tomato
4  2013-06-20   Kg       22       26     24.0  Tomato

In [14]:
def media_tomate(media):
  if media >= 40 and media <= 70:
    return "Tomatão"
  elif media >= 20 and media <= 40:
    return "Tomate medio"
  else:
    return "Tomatinho"

In [15]:
df_csv["Categoria_Tomate"] = df_csv["Average"].apply(media_tomate)

In [16]:
df_csv.tail()

            Date Unit  Minimum  Maximum  Average  Market Categoria_Tomate
2736  2021-05-09   Kg       10       15     12.5  Tomato        Tomatinho
2737  2021-05-10   Kg       10       15     12.5  Tomato        Tomatinho
2738  2021-05-11   Kg       10       15     12.5  Tomato        Tomatinho
2739  2021-05-12   Kg       30       35     32.5  Tomato     Tomate medio
2740  2021-05-13   Kg       35       40     37.5  Tomato     Tomate medio

In [17]:
df_csv.groupby("Categoria_Tomate").describe()

                 Minimum                                                       \
                   count       mean        std   min   25%   50%   75%    max
Categoria_Tomate
Tomate medio      1296.0  26.611111   5.537098  15.0  20.0  25.0  30.0   38.0
Tomatinho          491.0  32.737271  28.755092   8.0  15.0  15.0  70.0  115.0
Tomatão            954.0  47.818658   8.203065  30.0  40.0  45.0  55.0   65.0

                 Maximum             ...              Average             \
                   count       mean  ...   75%    max   count       mean
Categoria_Tomate                     ...
Tomate medio      1296.0  32.310957  ...  35.0   44.0  1296.0  29.461034
Tomatinho          491.0  38.285132  ...  75.0  120.0   491.0  35.511202
Tomatão            954.0  55.009434  ...  60.0   75.0   954.0  51.414046


                        std   min   25%   50%   75%    max
Categoria_Tomate
Tomate medio       5.408186  20.0  25.0  29.5  32.5   39.5
Tomatinho         29.170634  10.0  17.5  17.5  72.5  117.5
Tomatão            8.272792  40.0  45.0  50.0  57.5   70.0

[3 rows x 24 columns]

# Numpy

In [18]:
import numpy as np

In [19]:
set(df_csv['Categoria_Tomate'])

{'Tomate medio', 'Tomatinho', 'Tomatão'}

In [20]:
arr_list = np.array([1, 2, 3, 4, 5, 5, 7, 8])

In [21]:
print(arr_list)

[1 2 3 4 5 5 7 8]

In [22]:
arr_zeros  = np.zeros((4 , 6)) #Criando um array de zeros com 4 linhas e 6 colunas.
print(arr_zeros)

[[0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0.]]

In [23]:
arr_ones = np.ones((3, 4)) #Criando um array de uns com 3 linhas e 4 colunas.

In [24]:
print(arr_ones)

[[1. 1. 1. 1.]
 [1. 1. 1. 1.]
 [1. 1. 1. 1.]]

In [25]:
arr_random = np.random.rand(3 ,4) #Criando um array de numeros aleatorios com 3 linhas e 4 colunas.

In [26]:
print(arr_random)

[[0.84310562 0.3419037  0.22032919 0.62373323]
 [0.93371875 0.92965812 0.05832479 0.14244885]
 [0.51374008 0.68450775 0.59724115 0.84110054]]

In [27]:
print(arr_random.shape)
# função shape = analisa da dimensão do dado.

(3, 4)

In [28]:
arr_random_reshape = arr_random.reshape(4, 3) #Redimensionando o array para 4 linhas e 3 colunas.
print(arr_random_reshape) # Reduzindo a dimensão do array ou dados.

[[0.84310562 0.3419037  0.22032919]
 [0.62373323 0.93371875 0.92965812]
 [0.05832479 0.14244885 0.51374008]
 [0.68450775 0.59724115 0.84110054]]

In [29]:
# Criando lista de listas para criar um array multidimensional.
arr1 = np.array([[1, 2,], [3, 4]])
arr2 = np.array([[5, 6], [7, 8]])
arr3 = np.array([[9, 10], [11, 12]])

In [30]:
print(arr1)

[[1 2]
 [3 4]]

In [31]:
# concatenando arrays
arr4 = np.concatenate((arr1, arr2, arr3), axis=1) #Concatenando os arrays na horizontal.

In [32]:
arr4

array([[ 1,  2,  5,  6,  9, 10],
       [ 3,  4,  7,  8, 11, 12]])

In [33]:
# Dividindo arrays

arr4_split = np.split(arr4, 2, axis=1) #Dividindo o array em 2 partes.

In [34]:
arr4_split

[array([[1, 2, 5],
        [3, 4, 7]]),
 array([[ 6,  9, 10],
        [ 8, 11, 12]])]

In [35]:
arr4_transpose = np.transpose(arr4) #Transpondo o array.

In [36]:
arr4_transpose

array([[ 1,  3],
       [ 2,  4],
       [ 5,  7],
       [ 6,  8],
       [ 9, 11],
       [10, 12]])

In [37]:
arr_reverse = arr4_transpose.T #Invertendo o array.

In [38]:
arr_reverse

array([[ 1,  2,  5,  6,  9, 10],
       [ 3,  4,  7,  8, 11, 12]])

In [39]:
arr_a = np.array([7 ,17 , 24])
arr_b = np.array([10, 20, 30])

In [ ]:
arr_a_b = np.add(arr_a, arr_b) #Somando os arrays.